In [0]:
import pandas as pd

In [0]:
df = pd.read_csv("./avg_wv_relation.csv")

In [0]:
df.columns = ['name', 'gender', 'character']

In [0]:
df = df.iloc[:, 0:3]

In [0]:
df.head()

                     name   gender character
0     Anil_Aan Milo Sajna     MALE       NaN
1  Savitri_Aan Milo Sajna   FEMALE       NaN
2  Deepali_Aan Milo Sajna   FEMALE       NaN
3        Shekar_Abhinetri  UNKNOWN       NaN
4        Anjana_Abhinetri   FEMALE       NaN

In [0]:
df1 = df.dropna()

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16933 entries, 0 to 16932
Data columns (total 3 columns):
name         16933 non-null object
gender       16926 non-null object
character    5443 non-null object
dtypes: object(3)
memory usage: 396.9+ KB

In [0]:
df.columns= ['index', 'name', 'gender', 'character']

In [0]:
df.head()

   index                 name   gender               character
0      6       father_Bachpan     MALE              unhappilly
1      7        Rahim_Bachpan     MALE  father, father, father
2      8        Kashi_Bachpan  UNKNOWN                innocent
3     11  actor_Bombay Talkie     MALE                  famous
4     12         Seema_Chetna   FEMALE          unrecognizable

In [0]:
df = df.drop(['index'], axis=1)
df.to_csv(path_or_buf='./processed/first.csv', index=True)

In [0]:
df.head()

                  name   gender               character
0       father_Bachpan     MALE              unhappilly
1        Rahim_Bachpan     MALE  father, father, father
2        Kashi_Bachpan  UNKNOWN                innocent
3  actor_Bombay Talkie     MALE                  famous
4         Seema_Chetna   FEMALE          unrecognizable

In [0]:
df1 = pd.read_csv("./processed/first.csv")
df2 = pd.read_csv("./male_mentions_centrality.csv")

In [0]:
df2.head()

,MOVIE NAME,CAST,MENTIONS,TOTAL CENTRALITY,COUNT,AVERAGE CENTRALITY
0,Aan Milo Sajna,anil,13.0,9219.200000,131.0,70.375573
1,Bachpan,tom,11.0,29.000000,59.0,0.491525
2,Bachpan,father,5.0,469.333333,63.0,7.449735
3,Bachpan,rahim,2.0,0.000000,29.0,0.000000
4,Aag Aur Shola,nagesh,4.0,94.000000,38.0,2.473684

In [0]:
df1["name"] = df1["name"].str.lower()
df1.head()

   index                 name   gender               character
0      0       father_bachpan     MALE              unhappilly
1      1        rahim_bachpan     MALE  father, father, father
2      2        kashi_bachpan  UNKNOWN                innocent
3      3  actor_bombay talkie     MALE                  famous
4      4         seema_chetna   FEMALE          unrecognizable

In [0]:
df1.columns = ['index', 'name', 'gender', 'character']

In [0]:
df2.columns = ['MOVIE NAME', 'CAST', 'MENTIONS', 'TOTAL CENTRALITY', 'COUNT', 'AVERAGE CENTRALITY']

In [0]:
df2['name'] = df2['CAST'] + "_" + df2['MOVIE NAME']

In [0]:
df2["name"] = df2["name"].str.lower()

In [0]:
df2.head()

,MOVIE NAME,CAST,MENTIONS,TOTAL CENTRALITY,COUNT,AVERAGE CENTRALITY,name
0,Aan Milo Sajna,anil,13.0,9219.200000,131.0,70.375573,anil_aan milo sajna
1,Bachpan,tom,11.0,29.000000,59.0,0.491525,tom_bachpan
2,Bachpan,father,5.0,469.333333,63.0,7.449735,father_bachpan
3,Bachpan,rahim,2.0,0.000000,29.0,0.000000,rahim_bachpan
4,Aag Aur Shola,nagesh,4.0,94.000000,38.0,2.473684,nagesh_aag aur shola

In [0]:
result = pd.merge(df1, df2[['MOVIE NAME', 'MENTIONS', 'COUNT', 'TOTAL CENTRALITY', 'name']], on='name', how='right')
result = result.drop(['index'], axis=1)
result.head()

,name,gender,character,MOVIE NAME,MENTIONS,COUNT,TOTAL CENTRALITY
0,father_bachpan,MALE,unhappilly,Bachpan,5.0,63.0,469.333333
1,rahim_bachpan,MALE,"father, father, father",Bachpan,2.0,29.0,0.000000
2,actor_bombay talkie,MALE,famous,Bombay Talkie,1.0,4.0,15.000000
3,man_chetna,MALE,"shy, young",Chetna,1.0,25.0,368.166667
4,anil_chetna,MALE,"father, father, father",Chetna,18.0,180.0,526.000000

In [0]:
result.columns = result.columns.str.lower()

In [0]:
result.to_csv(path_or_buf='./processed/second.csv', index=True)

In [0]:
result.head()

,name,gender,character,movie name,mentions,count,total centrality
0,father_bachpan,MALE,unhappilly,Bachpan,5.0,63.0,469.333333
1,rahim_bachpan,MALE,"father, father, father",Bachpan,2.0,29.0,0.000000
2,actor_bombay talkie,MALE,famous,Bombay Talkie,1.0,4.0,15.000000
3,man_chetna,MALE,"shy, young",Chetna,1.0,25.0,368.166667
4,anil_chetna,MALE,"father, father, father",Chetna,18.0,180.0,526.000000